<template>
    <div class="terms">
        <div class="logo">
            <img src="./header/logo-with-title.svg" alt="">
        </div>
        <div class="terms-content">
            <p class="title">Terms and Conditions of Dmartech</p>
            <p class="title">条款和条件</p>
            <p class="ver">Version: 201807</p> <br>
            <p>
                1.甲方和乙方知悉并清楚，中国政府对互联网、电信等渠道的监管在日益加强，故乙方承诺将按照《合同法》、《电信条例》、《互联网电子邮件服务管理办法》、《广告法》、《全国人民代表大会常务委员会关于加强网络信息保护的决定》、《互联网广告管理暂行办法》、《网络安全法》、《工业和信息化部关于开展深入治理垃圾短信息专项行动的通知》（工信部电管函[2013]160号）、《通信短信息服务管理规定》（工业和信息化部令第31号）等不时更新的法律、法规及中国政府有关互联网电子邮件服务、短消息、互联网广告、微信、数据保护方面的相关规定，来使用Dmartech智慧营销平台（以下简称“Dmartech平台”），并承诺遵守不时更新的本条款和条件。</p>
            <br>
            <p>2.Dmartech平台的品牌和著作权（包括但不限于平台、软件中的图表、图片、动画、视频、音频、音乐、文本以及源代码）是甲方的财产
                。Dmartech平台及软件受相关著作权和知识产权的法律保护。甲方确保乙方在使用Dmartech平台时，不会因Dmartech平台本身的所有权、著作权，而侵犯其他任何第三人的合法著作权或所有权。甲方未授予乙方Dmartech平台及软件的所有权、著作权等相关知识产权。乙方以非专有的形式使用Dmartech平台，一旦登录Dmartech平台，即表明同意本条款和条件。</p>
            <br>
            <p>
                乙方确保，不会因其使用Dmartech平台时导致任何收件人或第三方向甲方索赔或被要求承担责任。乙方保证如因其不正当使用Dmartech平台时，致使甲方发生或被主张任何责任，乙方将向甲方支付全额赔偿，使之免受损害，并尽最大之能力为之抗辩。</p>
            <br>
            <p>3.甲方以ASP模式（Application Service
                Provider）向乙方提供服务，即甲方授权乙方通过互联网使用Dmartech平台，乙方通过互联网远程获得服务。使用Dmartech平台，是指使用此平台来生成、投递、追踪用于营销活动的电子邮件、短信和微信（通过乙方自己的微信公众号发送）等，以及报告与电子邮件、短信和微信营销活动有关的统计数据</p>
            <br>
            <p>
                4.甲方授权乙方使用Dmartech平台，是为乙方建立一个生成、投递、追踪用于营销活动的的平台，由乙方来使用该平台向收件人发送电子邮件、短信和微信，直接或者间接地推销商品或者服务；向何收件人发送、发送的内容等均由乙方根据其营销活动的需要来录入、添加、删减和变更。甲方仅是Dmartech平台的提供者。甲方并不收集、使用任何收件人包括电子邮件地址、姓名、电话号码、短信号码、微信号、位置数据、移动设备ID、IP地址、Cookies在内的任何个人电子信息，也不向任何收件人发送包括电子邮件、短信和微信在内的任何信息。</p>
            <br>
            <p>
                乙方利用Dmartech平台进行营销活动所使用的收件人个人电子信息（包括但不限于电子邮件地址、姓名、种族、电话号码、微信号、位置数据、移动设备ID、IP地址、Cookies、政治倾向、宗教和哲学信仰、个人健康数据、基因数据和生物数据等），应当是遵循合法、正当、必要的原则收集和使用的，且应明示收集、使用信息的目的、方式和范围，并经收件人同意；不得违反法律、法规的规定和约定来收集、使用信息</p>
            <br>
            <p>5.乙方在Dmartech平台中使用的所有收件人的电子邮件地址，都应是经收件人双重确认加入（“Double opt-in”）机制
                ，即收件人明确授权同意接受乙方通过Dmartech平台发送的电子邮件、短信和微信。未经收件人同意或者请求，或者收件人明确表示拒绝的，乙方不得使用Dmartech平台向其发送信息。</p> <br>
            <p>乙方保证其数据已经录入数据库的收件人有权从数据库中移除其数据，并选择退订的（“opt-out”）机制。</p> <br>
            <p>乙方向收件人提供的（“Double
                opt-in”）机制，必须清晰、简单、易懂、不含晦涩技术术语的让收件人作出明确的同意或授权，以便符合GDPR的要求；乙方向收件人提供的（“opt-out”）机制，必须使收件人同样容易的退出或移除其数据，以便符合GDPR的要求。</p>
            <br>
            <p>
                6.甲方和乙方应共同加强对使用Dmartech平台的管理。乙方（包含其员工或其授权或具有合同关系的任何个人、公司或组织）不得使用Dmartech平台制作、发送、传输任何法律、行政法规禁止的信息以及包含或可能包含以下内容的电子邮件：</p>
            <p>a. 违反宪法所确定的基本原则的, 损坏国家荣誉和利益的；</p>
            <p>b. 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的;</p>
            <p>c. 煽动民族仇恨、民族歧视，破坏民族团结的, 破坏国家民族宗教政策，宣扬邪教和封建迷信的；</p>
            <p>d. 散布谣言，扰乱社会秩序，破坏社会稳定的;</p>
            <p>e. 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的;</p>
            <p>f. 侮辱或者诽谤他人，侵害他人合法权益的;</p>
            <p>g. 法律、法规或行业规范禁止的其他内容的。</p>
            <p>h. 可能与他人构成不正当竞争或侵犯他人商业秘密的内容。</p> <br>
            <p>根据《广告法》第九条的规定，乙方及其员工，以及经乙方授权使用Dmartech平台的任何个人、公司或组织，均不应使用软件平台发送包含或可能包含以下内容的短信：</p>
            <p>a.使用或者变相使用中华人民共和国的国旗、国歌、国徽，军旗、军歌、军徽；</p>
            <p>b.使用或者变相使用国家机关、国家机关工作人员的名义或者形象；</p>
            <p>c.使用“国家级”、“最高级”、“最佳”等用语；</p>
            <p>d.损害国家的尊严或者利益，泄露国家秘密；</p>
            <p>e.妨碍社会安定，损害社会公共利益；</p>
            <p>f.危害人身、财产安全，泄露个人隐私；</p>
            <p>g.妨碍社会公共秩序或者违背社会良好风尚；</p>
            <p>h.含有淫秽、色情、赌博、迷信、恐怖、暴力的内容；</p>
            <p>i.含有民族、种族、宗教、性别歧视的内容；</p>
            <p>j.妨碍环境、自然资源或者文化遗产保护；</p>
            <p>k.法律、行政法规规定禁止的其他情形。</p> <br>
            <p>7.根据《互联网广告管理暂行办法》第五条的规定，乙方（包含其员工或其授权或具有合同关系的任何个人、公司或组织）不得使用Dmartech平台制作、发送、传输包含或可能包含处方药和烟草广告的信息。</p> <br>
            <p>
                根据《互联网广告管理暂行办法》第六条的规定，乙方（包含其员工或其授权或具有合同关系的任何个人、公司或组织）使用Dmartech平台制作、发送、传输涉及医疗、药品、特殊医学用途配方食品、医疗器械、农药、兽药、保健食品等法律、行政法规规定需经广告审查机关进行审查的特殊商品或者服务内容的信息，乙方需核查是否经广告审查机关进行审查批准；未经审查的，不得使用Dmartech平台制作、发送。</p>
            <br>
            <p>根据《互联网广告管理暂行办法》第七条，乙方使用Dmartech平台制作、发送包含推销商品或者服务等内容的电子邮件时，需在电子邮件标题或显著位置标明“广告”字样，使收件人能够辨明其为广告。</p> <br>
            <p>甲方如发现上述情况的，有权立即停止乙方使用Dmartech平台，并有权保存有关记录向有关部门报告；同时甲方有权立即无条件解除本合同，由此造成的损失，由乙方承担。</p> <br>
            <p>
                8.甲方和乙方应共同加强对垃圾信息的监管。由于通过Dmartech平台向何收件人发送、发送的内容信息等均由乙方根据其营销活动的需要自行来录入、添加、删减和变更，故乙方（包含其员工或其授权的任何个人、公司或组织）不得使用Dmartech平台发送垃圾邮件、垃圾短信或垃圾信息。甲方如发现乙方（包含其员工以及经授权使用的任何个人、公司或组织）发送垃圾邮件、垃圾短信或垃圾信息的，有权立即暂停乙方使用、要求立即改正、保存相关记录向有关监管部门报告或无条件解除本合同。</p>
            <br>
            <p>
                9.乙方应确保其提供的收件人地址的合法性、准确性和有效性。如因乙方提供的收件人地址导致邮件接收服务器反馈为“硬性弹回”或“软性弹回”的，甲方并不承担任何责任。如乙方提供的收件人地址导致“硬性弹回”或“软性弹回”频繁出现或大数量出现，甲方或其它邮件接受方将视为发送垃圾邮件的行为，有权立即暂停乙方使用Dmartech平台、要求立即改正、保存相关记录向有关监管部门报告。如乙方在限定的时间期限内没有改正的，甲方有权无条件解除本合同并不承担任何赔偿责任。如乙方因发送垃圾邮件、垃圾短信或垃圾信息导致甲方被投诉后承担责任的，乙方应全额赔偿甲方遭受的损失，无论这些损失是直接还是间接的。</p>
            <br>
            <p>
                10.在使用Dmartech平台时，乙方录入的平台的收件人邮件地址列表数据、邮件地址关联数据、动态反馈历史数据、用户手机号码、短信内容、微信号等数据，等同于乙方的实物或财务资产，甲方将予以保密。未经乙方书面同意，甲方无权使用或向任何第三方泄露、转让数据库的信息。由于乙方或其工作人员自身的原因或行为，将上述保密信息或数据告知他人或与他人共享，由此导致的任何私密信息和数据的泄露，甲方不承担任何责任。由于政府管制、不可抗力、司法部门依法要求等情况下，造成的乙方上述保密信息或数据的泄露、丢失、被盗用或被篡改等，甲方有责任及时告知乙方，但不承担任何经济赔偿责任。</p>
            <br>
            <p>
                11.如因不可抗力（包括超过一方合理控制且并非该方的过错或疏忽造成的事件或情势，如天灾、战争、政府法律、法令、要求或行为、罢工、流行疾病、内乱、火灾、水灾、意外事故等）致使任何一方不能履行本合同的，该方不负违约责任。但应在合理的时间内向对方报告所发生的不可抗力并提供有关政府部门的证明文件。由于是通过互联网使用Dmartech平台的，鉴于互联网之特殊性质，不可抗力亦包括因政府管制而造成互联网的暂时关闭、电信部门技术调整导致的影响、服务器宕机、遭到黑客或病毒攻击或侵袭等情形。</p>
            <br>
            <p>12.使用Dmartech平台发送微信的，是通过乙方自有的微信公众号进行的，故乙方也应遵守腾讯的《微信公众平台服务协议》、《微信公众平台运营规范》及腾讯不时更新的相关规则。</p> <br>
            <p>
                13.为了维护双方的共同利益，反对商业贿赂行为，促进双方良好发展，双方及工作人员应严格遵守《中华人民共和国反不正当竞争法》、《刑法》、《关于开展治理商业贿赂专项工作的意见》等法律法规，坚决拒绝商业贿赂、行贿及其他不正当之商业行为的馈赠。甲方任何员工、部门不得以甲方或非甲方名义向乙方索取或收受金钱、物品及任何形式的馈赠。
                不得在乙方报销任何应由个人支付的费用；不得以任何形式向乙方索要回扣或变相收受贿赂。乙方或乙方工作人员不得以乙方或个人名义，采用财物或者其他手段贿赂甲方和/或甲方任何员工，包括给与金钱、财物或其他利益，包括帐外私下回扣，包括私下直接或间接赠送礼金、物品、有价证券或采取其他变相手段提供不正当利益。若甲方员工要求乙方给予其任何形式的不正当利益，乙方必须及时投诉，并提供相关证据给甲方，经甲方查实后作出处理，并为乙方保密。对于乙方的协助，甲方将根据情况给予乙方更多的商业机会。</p>
            <br>
            <p>14.乙方同意适用本条款和条件的，是使用Dmartech平台的前提条件，否则乙方将无法使用Dmartech平台。甲方保留不时修改本条款和条件的权利。修改后的本条款和条件，自在网页公布日其对双方有约束力。</p>
        </div>
    </div>
</template>
<script>
    export default {
        name: 'terms'
    };
</script>
<style lang="scss">
    @import "../common/scss/base/variables";
    @import "../common/scss/base/mixin";

    .terms {
        position: relative;
        overflow: hidden;
        @include box-sizing;
        height: 100vh;
        width: 100vw;
        background: $content-bg url('./login/login-bg.svg') no-repeat center;
        @include background-size(cover);

        .logo {
            position: absolute;
            left: 3%;
            top: 3%;
            width: 200px;
        }

        .terms-content {
            overflow: auto;
            height: 80vh;
            margin: 10vh 10vw;
            box-sizing: border-box;
            padding: $input-field-height $input-field-height $input-field-height*2;
            background-color: white;

            .title {
                text-align: center;
                font-size: 20px;
                font-weight: bold;
                line-height: $input-field-height;
            }

            .ver {
                text-align: right;
            }
        }
    }
</style>
